In [1]:
import pandas as pd
import numpy as np

In [5]:
# columns: year, ncessch, ncessch_num, leaid, fips, grade, race, sex, enrollment
cols = ['ncessch_num', 'grade', 'race', 'sex', 'enrollment']

df = pd.read_csv('schools_enrollment_2021.csv', usecols=cols)
df.head()

   grade  race  enrollment
0     -1     1   1051226.0
1     -1     2    452464.0
2     -1     3    707866.0
3     -1     4     95604.0
4     -1     5     25142.0

In [6]:
sorted(df['grade'].unique())

[-1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

-1—Pre-K
0—Kindergarten
1—1
2—2
3—3
4—4
5—5
6—6
7—7
8—8
9—9
10—10
11—11
12—12
13—13
14—Adult education
15—Ungraded
99—Total
999—Not specified

In [4]:
# dropping 15, 99, and 999
df = df[df['grade'].isin([i for i in range(-1, 15)])]

sorted(df['grade'].unique())

[-1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14]

1—White
2—Black
3—Hispanic
4—Asian
5—American Indian or Alaska Native
6—Native Hawaiian or other Pacific Islander
7—Two or more races
8—Nonresident alien
9—Unknown
20—Other
99—Total
-1—Missing/not reported
-2—Not applicable
-3—Suppressed data

In [5]:
sorted(df['race'].unique())

[1, 2, 3, 4, 5, 6, 7, 9, 99]

In [6]:
# dropping 9 and 99
df = df[df['race'].isin([i for i in range(1, 8)])]

sorted(df['race'].unique())

[1, 2, 3, 4, 5, 6, 7]

In [7]:
enrollment_df = df.groupby(['grade', 'race'])['enrollment'].sum().reset_index()
enrollment_df.head()

   grade  race  enrollment
0     -1     1   1051226.0
1     -1     2    452464.0
2     -1     3    707866.0
3     -1     4     95604.0
4     -1     5     25142.0

In [8]:
enrollment_df.to_csv('2021_enrollment_df.csv', index=False)

In [9]:
# change race from numbers to strings
cleaned_df = pd.read_csv('2021_enrollment_df.csv')
cleaned_df['race'] = df['race'].map({
    1: 'White',
    2: 'Black',
    3: 'Hispanic',
    4: 'Asian',
    5: 'American Indian or Alaska Native',
    6: 'Native Hawaiian or other Pacific Islander',
    7: 'Two or more races',
    8: 'Nonresident alien',
    9: 'Unknown',
    20: 'Other',
    99: 'Total',
    -1: 'Missing/not reported',
    -2: 'Not applicable',
    -3: 'Suppressed data'
})
cleaned_df

     grade                                       race  enrollment
0       -1                                      White   1051226.0
1       -1                                      Black    452464.0
2       -1                                   Hispanic    707866.0
3       -1                                      Asian     95604.0
4       -1           American Indian or Alaska Native     25142.0
..     ...                                        ...         ...
107     14                                   Hispanic      6322.0
108     14                                      Asian       266.0
109     14           American Indian or Alaska Native       126.0
110     14  Native Hawaiian or other Pacific Islander       140.0
111     14                          Two or more races       350.0

[112 rows x 3 columns]

In [10]:
cleaned_df.to_csv('2021_enrollment_df.csv', index=False)